src/index.org
* Data/APIs
- [[https://openweathermap.org/api][OpenWeather API]]: [[https://openweathermap.org][OpenWeather]] provides hyperlocal minute forecast, historical data, current state, and from short-term to annual and forecasted weather data.
- [[https://maps3.arcgisonline.com/arcgis/rest/services][ArcGIS REST Services Directory]]: The ArcGIS REST API, short for Representational State Transfer, provides a simple, open web interface to ArcGIS.
- [[https://restgis.com][REST GIS]]: A simple API that provides geographic data for any location in the world, with support for GeoJSON, TopoJSON and SVG.
- [[https://landscan.ornl.gov][LandScan]]: The LandScan Program was initiated at Oak Ridge National Laboratory (ORNL) in 1997 to address the need for improved estimates of population for consequence assessment.
- [[https://earthexplorer.usgs.gov][EarthExplorer]]: EarthExplorer (EE) provides online search, browse display, metadata export, and data download for earth science data from the archives of the U.S. Geological Survey (USGS).
- [[https://oec.world/en/resources/documentation][OEC API]]: The Observatory of Economic Complexity (OEC) is an online data visualization and distribution platform focused on the geography and dynamics of economic activities.
- [[https://wiki.openstreetmap.org/wiki/API][OpenStreetMap API]]: [[https://www.openstreetmap.org][OpenStreetMap]] is a map of the world, created by people like you and free to use under an open license. OpenStreetMap has an editing API for fetching and saving raw geodata from/to the OpenStreetMap database.
- [[https://www.naturalearthdata.com][Natural Earth]]: Natural Earth is a public domain map dataset available at 1:10m, 1:50m, and 1:110 million scales.
- [[http://www.geodata.cn][国家地球系统科学数据中心共享服务平台（National Earth System Science Data Center）]]: The Center is devoted to enhancing highquality scientific and technological resources integration and providing network-based and socialized data sharing services for scientific research, technological progress and social development. (Chinese)
- [[https://simplemaps.com][simplemaps]]: strive to create the best interactive maps on the web while also making it simple to customize and install them.
- [[http://kmap.ckcest.cn][地理信息专业知识服务系统（Geographic Information Professional Knowledge Service System）]]: (Chinese)
- [[https://opentopography.org/developers][OpenTopography]]: OpenTopography facilitates community access to high-resolution, Earth science-oriented, topography data, and related tools and resources.
- [[https://geodata.lib.utexas.edu][GeoData - University of Texas Libraries]]: Explore geospatial data from UT Austin and beyond.
- [[https://developers.google.com/maps/documentation][Google Maps Platform Documentation]]: All the information you need to bring the real world to your web and mobile apps with Google Maps Platform SDKs and APIs for Maps, Routes, and Places.
- [[https://mygeodata.cloud][MyGeodata Cloud]]: Download shared GIS data or upload your own GIS data, convert them on-line to various GIS/CAD formats and coordinate systems, show your GIS data on a map, share or publish your data, and much more...
- [[https://data.census.gov/][United States Census Bureau Data]]: The Census Bureau is the leading source of quality data about the nation's people and economy.
- [[https://missingmigrants.iom.int/data][Missing Migrants Project]]: Missing Migrants Project tracks incidents involving migrants, including refugees and asylum-seekers, who have died or gone missing in the process of migration towards an international destination.
- [[https://www.fao.org/statistics][Statistics - Food and Agriculture Organization of the United Nations]]: FAO is dedicated to collecting, analysing, interpreting and disseminating food and agriculture statistics that are relevant for decision-making.
- [[https://www.tianditu.gov.cn][天地图 - 国家地理信息公共服务平台（National Platform for Common Geospatial Information Services）]]: (Chinese)
- [[https://data.stats.gov.cn/index.htm][国家数据 - 国家统计局（National Bureau of Statistics）]]: (Chinese)
- [[http://www.gscloud.cn][地理空间数据云（Geospatial Data Cloud）]]: 遥感数据一站式服务。(Chinese)
- [[https://volcano.si.edu/database/webservices.cfm][Global Volcanism Program]]: The mission of GVP is to document, understand, and disseminate information about global volcanic activity.
- [[https://hgl.harvard.edu][Harvard Geospatial Library]]
- [[https://collections.ala.org.au/datasets][Atlas of Living Australia]]: The Atlas of Living Australia (ALA) is a collaborative, digital, open infrastructure that pulls together Australian biodiversity data from multiple sources, making it accessible and reusable.
- [[http://www.citypopulation.de][City Population]]: City Population provides for each country statistics and maps for the major cities, agglomerations and administrative divisions.
- [[https://www.flightradar24.com/data][Flightradar24]]: Flightradar24 is a global flight tracking service that provides you with real-time information about thousands of aircraft around the world.
- [[https://www.ncei.noaa.gov/access][National Centers for Environmental Information]]: NCEI environmental data spans a broad spectrum of scientific disciplines, archive methods, naming conventions, file formats, and governance strategies.
- [[https://github.com/microsoft/GlobalMLBuildingFootprints][Global ML Building Footprints]]: Worldwide building footprints derived from satellite imagery.
* Geosaptial Analysis Libraries/Tools
* GIS/RS Software
* Web GIS/Frontend GIS Frameworks
- [[https://www.esri.com/en-us/arcgis/products/arcgis-online/overview][ArcGIS Online]]: Cloud-based software to create and share interactive web maps.
- [[https://maplibre.org][MapLibre]]: Open-source mapping libraries for developers of web and mobile applications.
- [[https://github.com/maplibre/maplibre-rs][maplibre-rs]]: maplibre-rs is a portable and performant vector maps renderer. We aim to support web, mobile and desktop applications. This is achieved by the novel WebGPU specification.
* Spatial Databases
- [[https://postgis.net][PostGIS]]: PostGIS is a spatial database extender for [[https://postgresql.org/][PostgreSQL]] object-relational database. It adds support for geographic objects allowing location queries to be run in SQL.
* Organizations/Enterprises/Communities/Forums
- [[https://www.osgeo.org][OSGeo]]: The Open Source Geospatial Foundation (OSGeo) is a not-for-profit organization whose mission is to foster global adoption of open geospatial technology by being an inclusive software foundation devoted to an open philosophy and participatory community driven development.
- [[https://gisgeography.com][GISGeography]]: We are a team of GIS evangelists who are passionate about all aspects of GIS. This comes in the form of well-crafted geo-infographics, comprehensive guides, and exhaustive lists. This philosophy is at the heart of everything we do. GISGeography.com focuses on Geographic Information Systems (GIS) and Geography.
- [[https://www.usgs.gov][USGS]]: The USGS is the sole science agency for the Department of the Interior. It is sought out by thousands of partners and customers for its natural science expertise and its vast earth and biological data holdings.
- [[https://carto.com][CARTO]]: CARTO is the world’s leading Location Intelligence platform, enabling organizations to use spatial data and analysis for more efficient delivery routes, better behavioural marketing, strategic store placements, and much more.
* Mechanisms/Terminology
- [[https://en.wikipedia.org/wiki/K%C3%B6ppen_climate_classification][Köppen climate classification]]: The Köppen climate classification is one of the most widely used climate classification systems.
* Courses
