index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-19 四 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf2d6429">1. Data/APIs</a></li>
<li><a href="#org4fec972">2. Geosaptial Analysis Libraries/Tools</a></li>
<li><a href="#org2451aaa">3. GIS/RS Software</a></li>
<li><a href="#org89acf02">4. Web GIS</a></li>
<li><a href="#orga3f2d79">5. Spatial Databases</a></li>
<li><a href="#org1058eff">6. Organizations/Enterprises/Communities/Forums</a></li>
<li><a href="#org58c2ddb">7. Mechanisms/Terminology</a></li>
<li><a href="#org03f4a8d">8. Courses</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf2d6429" class="outline-2">
<h2 id="orgf2d6429"><span class="section-number-2">1.</span> Data/APIs</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://openweathermap.org/api">OpenWeather API</a>: <a href="https://openweathermap.org">OpenWeather</a> provides hyperlocal minute forecast, historical data, current state, and from short-term to annual and forecasted weather data.</li>
<li><a href="https://maps3.arcgisonline.com/arcgis/rest/services">ArcGIS REST Services Directory</a>: The ArcGIS REST API, short for Representational State Transfer, provides a simple, open web interface to ArcGIS.</li>
<li><a href="https://restgis.com">REST GIS</a>: A simple API that provides geographic data for any location in the world, with support for GeoJSON, TopoJSON and SVG.</li>
<li><a href="https://landscan.ornl.gov">LandScan</a>: The LandScan Program was initiated at Oak Ridge National Laboratory (ORNL) in 1997 to address the need for improved estimates of population for consequence assessment.</li>
<li><a href="https://earthexplorer.usgs.gov">EarthExplorer</a>: EarthExplorer (EE) provides online search, browse display, metadata export, and data download for earth science data from the archives of the U.S. Geological Survey (USGS).</li>
<li><a href="https://oec.world/en/resources/documentation">OEC API</a>: The Observatory of Economic Complexity (OEC) is an online data visualization and distribution platform focused on the geography and dynamics of economic activities.</li>
<li><a href="https://wiki.openstreetmap.org/wiki/API">OpenStreetMap API</a>: <a href="https://www.openstreetmap.org">OpenStreetMap</a> is a map of the world, created by people like you and free to use under an open license. OpenStreetMap has an editing API for fetching and saving raw geodata from/to the OpenStreetMap database.</li>
<li><a href="https://www.naturalearthdata.com">Natural Earth</a>: Natural Earth is a public domain map dataset available at 1:10m, 1:50m, and 1:110 million scales.</li>
<li><a href="http://www.geodata.cn">国家地球系统科学数据中心共享服务平台（National Earth System Science Data Center）</a>: The Center is devoted to enhancing highquality scientific and technological resources integration and providing network-based and socialized data sharing services for scientific research, technological progress and social development. (Chinese)</li>
<li><a href="https://simplemaps.com">simplemaps</a>: strive to create the best interactive maps on the web while also making it simple to customize and install them.</li>
<li><a href="http://kmap.ckcest.cn">地理信息专业知识服务系统（Geographic Information Professional Knowledge Service System）</a>: (Chinese)</li>
<li><a href="https://opentopography.org/developers">OpenTopography</a>: OpenTopography facilitates community access to high-resolution, Earth science-oriented, topography data, and related tools and resources.</li>
<li><a href="https://geodata.lib.utexas.edu">GeoData - University of Texas Libraries</a>: Explore geospatial data from UT Austin and beyond.</li>
<li><a href="https://developers.google.com/maps/documentation">Google Maps Platform Documentation</a>: All the information you need to bring the real world to your web and mobile apps with Google Maps Platform SDKs and APIs for Maps, Routes, and Places.</li>
<li><a href="https://mygeodata.cloud">MyGeodata Cloud</a>: Download shared GIS data or upload your own GIS data, convert them on-line to various GIS/CAD formats and coordinate systems, show your GIS data on a map, share or publish your data, and much more&#x2026;</li>
<li><a href="https://data.census.gov/">United States Census Bureau Data</a>: The Census Bureau is the leading source of quality data about the nation's people and economy.</li>
<li><a href="https://missingmigrants.iom.int/data">Missing Migrants Project</a>: Missing Migrants Project tracks incidents involving migrants, including refugees and asylum-seekers, who have died or gone missing in the process of migration towards an international destination.</li>
<li><a href="https://www.fao.org/statistics">Statistics - Food and Agriculture Organization of the United Nations</a>: FAO is dedicated to collecting, analysing, interpreting and disseminating food and agriculture statistics that are relevant for decision-making.</li>
<li><a href="https://www.tianditu.gov.cn">天地图 - 国家地理信息公共服务平台（National Platform for Common Geospatial Information Services）</a>: (Chinese)</li>
<li><a href="https://data.stats.gov.cn/index.htm">国家数据 - 国家统计局（National Bureau of Statistics）</a>: (Chinese)</li>
<li><a href="http://www.gscloud.cn">地理空间数据云（Geospatial Data Cloud）</a>: 遥感数据一站式服务。(Chinese)</li>
<li><a href="https://volcano.si.edu/database/webservices.cfm">Global Volcanism Program</a>: The mission of GVP is to document, understand, and disseminate information about global volcanic activity.</li>
<li><a href="https://hgl.harvard.edu">Harvard Geospatial Library</a></li>
<li><a href="https://collections.ala.org.au/datasets">Atlas of Living Australia</a>: The Atlas of Living Australia (ALA) is a collaborative, digital, open infrastructure that pulls together Australian biodiversity data from multiple sources, making it accessible and reusable.</li>
<li><a href="http://www.citypopulation.de">City Population</a>: City Population provides for each country statistics and maps for the major cities, agglomerations and administrative divisions.</li>
<li><a href="https://www.flightradar24.com/data">Flightradar24</a>: Flightradar24 is a global flight tracking service that provides you with real-time information about thousands of aircraft around the world.</li>
<li><a href="https://www.ncei.noaa.gov/access">National Centers for Environmental Information</a>: NCEI environmental data spans a broad spectrum of scientific disciplines, archive methods, naming conventions, file formats, and governance strategies.</li>
<li><a href="https://github.com/microsoft/GlobalMLBuildingFootprints">Global ML Building Footprints</a>: Worldwide building footprints derived from satellite imagery.</li>
</ul>
</div>
</div>
<div id="outline-container-org4fec972" class="outline-2">
<h2 id="org4fec972"><span class="section-number-2">2.</span> Geosaptial Analysis Libraries/Tools</h2>
</div>
<div id="outline-container-org2451aaa" class="outline-2">
<h2 id="org2451aaa"><span class="section-number-2">3.</span> GIS/RS Software</h2>
</div>
<div id="outline-container-org89acf02" class="outline-2">
<h2 id="org89acf02"><span class="section-number-2">4.</span> Web GIS</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://www.esri.com/en-us/arcgis/products/arcgis-online/overview">ArcGIS Online</a>: Cloud-based software to create and share interactive web maps.</li>
</ul>
</div>
</div>
<div id="outline-container-orga3f2d79" class="outline-2">
<h2 id="orga3f2d79"><span class="section-number-2">5.</span> Spatial Databases</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://postgis.net">PostGIS</a>: PostGIS is a spatial database extender for <a href="https://postgresql.org/">PostgreSQL</a> object-relational database. It adds support for geographic objects allowing location queries to be run in SQL.</li>
</ul>
</div>
</div>
<div id="outline-container-org1058eff" class="outline-2">
<h2 id="org1058eff"><span class="section-number-2">6.</span> Organizations/Enterprises/Communities/Forums</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://www.osgeo.org">OSGeo</a>: The Open Source Geospatial Foundation (OSGeo) is a not-for-profit organization whose mission is to foster global adoption of open geospatial technology by being an inclusive software foundation devoted to an open philosophy and participatory community driven development.</li>
<li><a href="https://gisgeography.com">GISGeography</a>: We are a team of GIS evangelists who are passionate about all aspects of GIS. This comes in the form of well-crafted geo-infographics, comprehensive guides, and exhaustive lists. This philosophy is at the heart of everything we do. GISGeography.com focuses on Geographic Information Systems (GIS) and Geography.</li>
<li><a href="https://www.usgs.gov">USGS</a>: The USGS is the sole science agency for the Department of the Interior. It is sought out by thousands of partners and customers for its natural science expertise and its vast earth and biological data holdings.</li>
<li><a href="https://carto.com">CARTO</a>: CARTO is the world’s leading Location Intelligence platform, enabling organizations to use spatial data and analysis for more efficient delivery routes, better behavioural marketing, strategic store placements, and much more.</li>
</ul>
</div>
</div>
<div id="outline-container-org58c2ddb" class="outline-2">
<h2 id="org58c2ddb"><span class="section-number-2">7.</span> Mechanisms/Terminology</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/K%C3%B6ppen_climate_classification">Köppen climate classification</a>: The Köppen climate classification is one of the most widely used climate classification systems.</li>
</ul>
</div>
</div>

<div id="outline-container-org03f4a8d" class="outline-2">
<h2 id="org03f4a8d"><span class="section-number-2">8.</span> Courses</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-05-19 四 11:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
